STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_MeshLightingProvisioner/STM32_WPAN/app/appli_mesh.c
/* Select Node as Sniffer, Means able to sniff all the packets 
*  0 - Filters are enabled and packets not targeted to node are filtered
*  1 - Filters are disabled and packets not targeted to node are not filtered
*/
MOBLEUINT8 DisableFilter = 0;

#if LOW_POWER_FEATURE
MOBLEINT32 BLEMesh_sleepTime;
MOBLEUINT32 SysRefCount;
MOBLEBOOL LPN_scan_enabled;
#endif

MOBLEUINT8 nvm_operation;
MOBLEUINT8 nvm_flash_page;
MOBLEUINT8 provisioning_completion;

/* Timer to control unprovisioned device beacons */
#if PB_ADV_SUPPORTED
MOBLEUINT8 discoverTimer_Id;
tClockTime discoverTimerinterval = DISCOVER_TIMER_INTERVAL;
#endif

#if (APPLI_OPTIM == 1)
MOBLEUINT8 appliTaskTimer_Id;
#endif
#if LOW_POWER_FEATURE
volatile uint8_t BleProcessInit = 0;
#endif
#if (LOW_POWER_FEATURE == 1)
MOBLEUINT8 lowPowerNodeApiTimer_Id;
#endif

MOBLEUINT8 pPropertyId[4];

/********************* Application configuration **************************/
#if defined(__GNUC__) || defined(__IAR_SYSTEMS_ICC__) || defined(__CC_ARM)
MOBLEUINT8 bdaddr[8];

#ifdef INTERNAL_UNIQUE_NUMBER_MAC
static void Appli_GetMACfromUniqueNumber(void);
#endif /* INTERNAL_UNIQUE_NUMBER_MAC */

const void *mobleNvmBase; 
const void *appNvmBase;
const void *prvsnr_data;
#else
#error "Unknown compiler"
#endif /* __GNUC__ || defined(__IAR_SYSTEMS_ICC__) || defined(__CC_ARM) */

#if ENABLE_SERIAL_INTERFACE
extern uint8_t button_emulation;
#endif

/* Private function prototypes -----------------------------------------------*/
static void Appli_LongButtonPress(void);
static void Appli_ShortButtonPress(void);
#if USER_OUTPUT_OOB_APPLI_PROCESS
void Appli_OobAuthenticationProcess(void);
#endif
#ifdef ENABLE_AUTH_TYPE_INPUT_OOB
static void InputOOBTimeOutTask(void);
#endif
void BLEMesh_UnprovisionCallback(MOBLEUINT8 reason);
void Appli_LowPowerProcess(void);
#if (APPLI_OPTIM == 1)
static void AppliMeshTask(void);
#endif
#if defined (ENABLE_PROVISIONER_FEATURE) || defined(DYNAMIC_PROVISIONER)
MOBLEUINT16 BLEMesh_PvnrDataInputCallback(MOBLEUINT8* devKey, MOBLEUINT8* appKey, MOBLEUINT8 noOfElements);
void Appli_SelfConfigurationProcess(void);
#endif
void Appli_GetPublicationParamsCb(model_publicationparams_t* pPubParameters);
WEAK_FUNCTION (void SerialPrvn_ProvisioningStatusUpdateCb(uint8_t flagPrvningInProcess, 
                                                          MOBLEUINT16 nodeAddress));

/* Private functions ---------------------------------------------------------*/

/************************* Button Control functions ********************/
/**
* @brief  Function calls when a button is pressed for short duration  
* @param  void
* @retval void
*/ 
static void Appli_ShortButtonPress(void)
{
  BLEMesh_ModelsCommand();
}
  

/**
* @brief  Function calls when a button is pressed for Long duration  
* @param  void
* @retval void
*/ 
static void Appli_LongButtonPress(void)
{
  /** GENERIC ONOFF **/  
//  TRACE_I(TF_GENERIC_CLIENT_M, "----------- Generic API ONOFF GET ------------- \r\n");
//  Appli_GenericClient_API(0, GENERIC_ON_OFF_GET, NULL);  
  
  /** GENERIC LEVEL **/  
//  TRACE_I(TF_GENERIC_CLIENT_M, "----------- Generic API LEVEL GET ------------- \r\n");
//  Appli_GenericClient_API(0, GENERIC_LEVEL_GET, NULL);  
  
  /** GENERIC POWER ONOFF **/  
//  TRACE_I(TF_GENERIC_CLIENT_M, "----------- Generic API POWER ON OFF GET ------------- \r\n");
//  Appli_GenericClient_API(0, GENERIC_POWER_ON_OFF_GET, NULL);  
  
  /** GENERIC TRANSITION TIME **/ 
//  TRACE_I(TF_GENERIC_CLIENT_M, "----------- Generic API DEFAULT TRANSITION TIME GET ------------- \r\n");
//  Appli_GenericClient_API(0, GENERIC_DEFAULT_TRANSITION_TIME_GET, NULL);  
  
  /** LIGHT LIGHTNESS **/   
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT LIGHTNESS GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_LIGHTNESS_GET, NULL);  
  
  /** LIGHT LIGHTNESS LINEAR **/ 
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT LIGHTNESS LINEAR GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_LIGHTNESS_LINEAR_GET, NULL);  
  
  /** LIGHT LIGHTNESS DEFAULT **/ 
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT LIGHTNESS DEFAULT GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_LIGHTNESS_DEFAULT_GET, NULL);  
  
  /** LIGHT LIGHTNESS RANGE **/ 
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT LIGHTNESS RANGE GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_LIGHTNESS_RANGE_GET, NULL); 
  
  /** LIGHT LIGHTNESS CTL **/
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT CTL GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_CTL_GET, NULL);  
  
  /** LIGHT LIGHTNESS CTL TEMPERATURE **/
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT CTL TEMPERATURE GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_CTL_TEMPERATURE_GET, NULL);  
  
  /** LIGHT LIGHTNESS CTL TEMPERATURE RANGE **/
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT CTL TEMPERATURE RANGE GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_CTL_TEMPERATURE_RANGE_GET, NULL);  
  
  /** LIGHT LIGHTNESS CTL DEFAULT **/
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT CTL DEFAULT GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_CTL_DEFAULT_GET, NULL);  
  
  /** LIGHT LIGHTNESS HSL **/
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT HSL GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_HSL_GET, NULL);  

  /** LIGHT LIGHTNESS HSL DEFAULT **/
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT HSL DEFAULT GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_HSL_DEFAULT_GET, NULL);  

  /** LIGHT LIGHTNESS HSL RANGE**/
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT HSL RANGE GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_HSL_RANGE_GET, NULL);  
  
  /** LIGHT LIGHTNESS HSL HUE**/
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT HSL HUE GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_HSL_HUE_GET, NULL);
  
  /** LIGHT LIGHTNESS HSL SATURATION**/
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT HSL SATURATION GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_HSL_SATURATION_GET, NULL);

  /** LIGHT LC MODE**/
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT LC MODE GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_LC_MODE_GET, NULL);
  
  /** LIGHT LC OM**/
//  TRACE_I(TF_LIGHT_CLIENT_M, "----------- API LIGHT LC OM GET ------------- \r\n");
//  Appli_LightClient_API(0, LIGHT_LC_OM_GET, NULL);
  
