STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_MeshLightingProvisioner/STM32_WPAN/app/appli_mesh.c
  TRACE_I(TF_PROVISION,"Device is unprovisioned by application \r\n");      

  PalNvmErase(PRVN_NVM_BASE_OFFSET, 4);
  TRACE_I(TF_PROVISION,"NVM erased\r\n");      
  TRACE_I(TF_PROVISION,"Reset Device\r\n");      

  HAL_Delay(100);

  NVIC_SystemReset();
}

/*----------------------------------------------------------------------------*/
/* Following Functions are ONLY required for the Embedded Provisioner --------*/
#if (defined(ENABLE_PROVISIONER_FEATURE) || defined(DYNAMIC_PROVISIONER))
/*----------------------------------------------------------------------------*/

/**
* @brief  Initializes Provisioner Node
* @param  void 
* @retval void
*/
void Appli_ProvisionerInit(void)
{
  memset((void*)&NodeUnderProvisionParam, 0x00, sizeof(NodeUnderProvisionParam_t));
}


/**
* @brief  Function for saving the Provisioned node address
* @param  void 
* @retval void
*/
void SaveProvisionedNodeAddress(void)
{
  NodeUnderProvisionParam.nodeAddress = NodeUnderProvisionParam.newNodeAddress;
  NodeUnderProvisionParam.numOfElements = NodeUnderProvisionParam.newNodeElements;

  if (NodeUnderProvisionParam.saveToNVM == NVM_SAVE_PENDING)
  {
    NodeUnderProvisionParam.saveToNVM = NVM_INIT;
    AppliPrvnNvm_SaveKeys(1);  /* This will trigger the saving in flash */
  }
}


/**
* @brief  Getting the New Node Provisioning Device Key 
* @param  void 
* @retval void
*/
MOBLEUINT8* GetNewProvNodeDevKey(void)
{
  return &NodeUnderProvisionParam.NewProvNodeDevKey[0];
}


/**
* @brief  Getting the New Node under Provisioning Application Key 
* @param  void 
* @retval void
*/
MOBLEUINT8* GetNewProvNodeAppKey(void)
{
  return &NodeUnderProvisionParam.NewProvNodeAppKey[0];
}


/**
* @brief  Function to Get the Node Address for provisioning 
* @param  void
* @retval void
*/
MOBLE_ADDRESS GetAddressToConfigure(void)
{
  return NodeUnderProvisionParam.nodeAddress;
}


/**
* @brief  Function to Get the Node Address for provisioning 
* @param  void
* @retval void
*/
MOBLE_ADDRESS GetNewAddressToProvision(void)
{
  return NodeUnderProvisionParam.nodeAddress + NodeUnderProvisionParam.numOfElements;
}

  
/**
* @brief  callback for getting the Node Address by provisioner & giving device key, app key & number of elements.
* @param  device key, app key & number of elements
* @retval To be assigned Node Address
*/
MOBLEUINT16 BLEMesh_PvnrDataInputCallback(MOBLEUINT8* devKey, 
                                              MOBLEUINT8* appKey, 
                                              MOBLEUINT8 numOfElements)
{
  MOBLE_ADDRESS newNodeAddressToProvision;
  MOBLEUINT8 *pUUID = {0};  /* Not used currently, not passed by Provisioner */
  
  /* Make a copy for DeviceKey and ApplicationKey, these are required later for 
       device configuration */
  memcpy(&NodeUnderProvisionParam.NewProvNodeDevKey[0], devKey, DEVICE_KEY_SIZE);
  memcpy(&NodeUnderProvisionParam.NewProvNodeAppKey[0], appKey, APP_KEY_SIZE);
  
  /* Print the keys for user */
  TRACE_I(TF_PROVISION,"Device Key: ");
  for (MOBLEUINT8 count=0 ; count<DEVICE_KEY_SIZE; count++)
  {
    TRACE_I(TF_PROVISION,"%.2x ", NodeUnderProvisionParam.NewProvNodeDevKey[count]);
  }

  TRACE_I(TF_PROVISION,"\r\n");
  
  TRACE_I(TF_PROVISION,"App Key: ");
  for (MOBLEUINT8 count=0 ; count<DEVICE_KEY_SIZE; count++)
  {
    TRACE_I(TF_PROVISION,"%.2x ", NodeUnderProvisionParam.NewProvNodeAppKey[count]);
  }
  
  TRACE_I(TF_PROVISION,"\r\n");
  
  newNodeAddressToProvision = GetNewAddressToProvision();
  TRACE_I(TF_PROVISION,"Node Address Assigned = %d \r\n",newNodeAddressToProvision);
  
  /* Save Dev key and number of Elements  */   
  AppliPrvnNvm_SaveData(NodeUnderProvisionParam.NewProvNodeDevKey,
                        newNodeAddressToProvision,
                        pUUID,
                        numOfElements);
  
  NodeUnderProvisionParam.saveToNVM = NVM_SAVE_PENDING;
  
  return newNodeAddressToProvision;
}


/**
* @brief  start Provisioner mode 
* @param  void
* @retval void
*/
void Appli_StartProvisionerMode(MOBLEUINT8 mode)
{
  MOBLEUINT8 prvsnrDevKey[16];
  MOBLEUINT8 PrvnDevKeyFlag = mode;
     
  /* Initializes Mesh network parameters */
  if(BLEMesh_CreateNetwork(prvsnrDevKey) != MOBLE_RESULT_SUCCESS)
  {
    TRACE_I(TF_PROVISION,"Failed to Create Network\r\n");
  }
  
  /* Following functions help to Configure the Provisioner to default settings*/
  Start_SelfConfiguration();

  TRACE_I(TF_PROVISION,"Provisioner node \r\n");
  TRACE_I(TF_PROVISION,"Provisioner Dev Key:");
  for(MOBLEUINT8 i=0;i<16;i++)
  {
    TRACE_I(TF_INIT,"[%02x] ",prvsnrDevKey[i]);
  }
  TRACE_I(TF_INIT,"\r\n"); 

  if (mode ==1)
  {
    AppliPrvnNvm_SaveProvisionerDevKey(&prvsnrDevKey[0],
                                       PROVISIONER_ROOT_ADDR_DEFAULT,
                                       &PrvnDevKeyFlag, 
                                       APPLICATION_NUMBER_OF_ELEMENTS);  
  }/* if (mode ==1) */
}


#define SELF_CONFIG_IDLE_STATE 0
#define SELF_CONFIG_INIT_STATE 1 
#define SELF_CONFIG_START_STATE 2
#define SELF_APPKEY_BIND_STATE 3
#define SELF_SUBSCRIBE_DEFAULT_STATE 4
#define SELF_PUBLISH_DEFAULT_STATE 5
uint8_t self_config_state= SELF_CONFIG_IDLE_STATE;

/**
* @brief  Process to do the self configuration of provisioner node
* @param  void
* @retval void
*/
void Start_SelfConfiguration (void)
{
  self_config_state = SELF_CONFIG_INIT_STATE;
}

/**
* @brief  Process to do the self configuration of provisioner node
* @param  void
* @retval void
*/
void Appli_SelfConfigurationProcess(void)
{
  /* Following functions help to Configure the Provisioner to default settings*/
    
  switch (self_config_state)
  {
    case SELF_CONFIG_IDLE_STATE:
     /* Nothing to do, just wait*/ 
      break;
      
    case SELF_CONFIG_INIT_STATE:
      {
         /* This state is just to make a "NVM Process" to run once, because the 
             function will exit after changing the state*/
        self_config_state = SELF_CONFIG_START_STATE;
      }
      break;
    
    case SELF_CONFIG_START_STATE:
      {
        if(ApplicationSetNodeSigModelList())
        {
          self_config_state = SELF_APPKEY_BIND_STATE;
        }
        else
        {
          TRACE_I(TF_PROVISION,"The number of Models enabled exceed the limit of %d !\r\n",
                  APPLICATION_SIG_MODELS_MAX_COUNT);   
          /* LED continuously blinks if library fails to initialize */
          while (1)
          {
            Appli_LedBlink();
          }
        }
      }
     break;
      
    case SELF_APPKEY_BIND_STATE:
      {
        if(Appli_ConfigClient_SelfDefaultAppKeyBind())
        {
          TRACE_I(TF_PROVISION,"Failed to Bind Default Application Key: retry\r\n");   
          self_config_state = SELF_APPKEY_BIND_STATE;
        }
        else
        {
          TRACE_I(TF_PROVISION,"Bind Default Application Key\r\n");   
          self_config_state = SELF_SUBSCRIBE_DEFAULT_STATE;
        }
      }
      break;
    
    case SELF_SUBSCRIBE_DEFAULT_STATE:
      {
        if(AppliConfigClient_SelfSubscriptionSetDefault())
        {
          TRACE_I(TF_PROVISION,"Failed to Set Default Subscription: retry\r\n");   
          self_config_state = SELF_SUBSCRIBE_DEFAULT_STATE;
        }
        else
        {
          TRACE_I(TF_PROVISION,"Set Default Subscription\r\n");   
          self_config_state = SELF_PUBLISH_DEFAULT_STATE;
        }
      }
      break;

